jamesmunns/nRF5-sdk/examples/ble_peripheral/experimental_ble_app_lns/main.c
/**@brief Function for handling the Battery measurement timer time-out.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the time-out handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


static void increment_time(ble_date_time_t * p_time)
{
    p_time->seconds++;
    if (p_time->seconds > 59)
    {
        p_time->seconds = 0;
        p_time->minutes++;
        if (p_time->minutes > 59)
        {
            p_time->minutes = 0;
            p_time->hours++;
            if (p_time->hours > 24)
            {
                p_time->hours = 0;
                p_time->day++;
                if (p_time->day > 31)
                {
                    p_time->day = 0;
                    p_time->month++;
                    if (p_time->month > 12)
                    {
                        p_time->year++;
                    }
                }
            }
        }
    }
}


static void navigation_simulation_update(void)
{
    m_sim_navigation.position_status = (ble_lns_pos_status_type_t)
    (
        ( (uint32_t) m_sim_navigation.position_status + 1) %
        ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
    );

    m_sim_navigation.heading_source = (ble_lns_heading_source_t)
    (
        ( (uint32_t) m_sim_navigation.heading_source  + 1) %
        ( (uint32_t) BLE_LNS_HEADING_SOURCE_COMPASS + 1)
    );

    m_sim_navigation.navigation_indicator_type = (ble_lns_nav_indicator_type_t)
    (
        ( (uint32_t) m_sim_navigation.navigation_indicator_type + 1) %
        ( (uint32_t) BLE_LNS_NAV_TO_DESTINATION + 1)
    );

    m_sim_navigation.waypoint_reached    = !m_sim_navigation.waypoint_reached;
    m_sim_navigation.destination_reached = !m_sim_navigation.destination_reached;
    m_sim_navigation.bearing++;
    m_sim_navigation.heading++;
    m_sim_navigation.remaining_distance++;
    m_sim_navigation.remaining_vert_distance++;

    increment_time(&m_sim_navigation.eta);
}


static void position_quality_simulation_update(void)
{
    m_sim_position_quality.position_status = (ble_lns_pos_status_type_t)
    (
        ( (uint32_t) m_sim_position_quality.position_status + 1) %
        ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
    );

    m_sim_position_quality.number_of_satellites_in_solution++;
    m_sim_position_quality.number_of_satellites_in_view++;
    m_sim_position_quality.time_to_first_fix++;
    m_sim_position_quality.ehpe++;
    m_sim_position_quality.evpe++;
    m_sim_position_quality.hdop++;
    m_sim_position_quality.vdop++;
}


/**@brief Provide simulated location and speed.
 */
static void loc_speed_simulation_update(void)
{
    m_sim_location_speed.position_status = (ble_lns_pos_status_type_t)
    (
        ( (uint32_t) m_sim_location_speed.position_status + 1) %
        ( (uint32_t) BLE_LNS_LAST_KNOWN_POSITION + 1)
    );

    m_sim_location_speed.data_format = (ble_lns_speed_distance_format_t)
    (
        ( (uint32_t) m_sim_location_speed.data_format + 1) %
        ( (uint32_t) BLE_LNS_SPEED_DISTANCE_FORMAT_3D + 1)
    );

    m_sim_location_speed.elevation_source = (ble_lns_elevation_source_t)
    (
        ( (uint32_t) m_sim_location_speed.elevation_source + 1) %
        ( (uint32_t) BLE_LNS_ELEV_SOURCE_OTHER + 1)
    );

    m_sim_location_speed.heading_source   = (ble_lns_heading_source_t)
    (
        ( (uint32_t) m_sim_location_speed.heading_source + 1) %
        ( (uint32_t) BLE_LNS_HEADING_SOURCE_COMPASS + 1)
    );

    m_sim_location_speed.total_distance++;
    m_sim_location_speed.latitude++;
    m_sim_location_speed.longitude++;
    m_sim_location_speed.elevation++;
    m_sim_location_speed.heading++;
    m_sim_location_speed.rolling_time++;

    increment_time(&m_sim_location_speed.utc_time);
}


/**@brief Location and navigation time-out handler.
 *
 * @details This function will be called each time the location and navigation measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the time-out handler.
 */
static void loc_and_nav_timeout_handler(void * p_context)
{
    ret_code_t err_code;

    UNUSED_PARAMETER(p_context);

    loc_speed_simulation_update();
    position_quality_simulation_update();
    navigation_simulation_update();

    err_code = ble_lns_loc_speed_send(&m_lns);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }

    err_code = ble_lns_navigation_send(&m_lns);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_loc_and_nav_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                loc_and_nav_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief GAP initialization.
 *
 * @details This function shall be used to set up all the necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_AND_NAV_DISP);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Initialize services that will be used by the application.
 *
 * @details Initialize the Location and Navigation, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t     err_code;
    ble_lns_init_t lns_init;
    ble_bas_init_t bas_init;
    ble_dis_init_t dis_init;

    memset(&lns_init, 0, sizeof(lns_init));

    lns_init.evt_handler      = on_lns_evt;
    lns_init.lncp_evt_handler = on_ln_ctrlpt_evt;
    lns_init.error_handler    = lns_error_handler;

